[
  {
    "id": "blog1",
    "title": "5 Tips for Perfect Biryani",
    "image": "Biryani.jpg",
    "excerpt": "Use aged basmati rice, layer meat and rice properly, and seal the pot for authentic dum aroma...",
    "content": "Making the perfect biryani requires patience and the right techniques. Here are five essential tips:\n1. Use aged basmati rice for long, fluffy grains. Soak the rice for 30 minutes before cooking to ensure it remains separate and doesn’t become sticky.\n2. Marinate meat with yogurt and spices for at least 4 hours, preferably overnight. This allows the flavors to penetrate deeply and makes the meat tender.\n3. Layer rice and meat alternately for perfect flavor blending. Add fried onions, fresh herbs, and a few drops of saffron milk between layers to enhance aroma and taste.\n4. Seal the lid with dough to trap steam (dum cooking). Cook on very low heat for 25-40 minutes to let all flavors infuse thoroughly.\n5. Top with fried onions, boiled eggs, and saffron milk for aroma. Garnish with fresh coriander, mint, and a drizzle of ghee before serving. You can also experiment with dry fruits and nuts for added texture and richness."
  },
  {
    "id": "blog2",
    "title": "Healthy Breakfast in 10 Minutes",
    "image": "breakfast.jpg",
    "excerpt": "Quick smoothies, oats, or scrambled eggs can fuel your morning — no excuses for skipping...",
    "content": "Start your day right with these quick breakfast ideas that are nutritious and delicious:\n- Blend fruits, milk, and oats for an energy-boosting smoothie. Add chia seeds, flax seeds, or a scoop of protein powder for extra nutrients.\n- Try scrambled eggs with veggies for a protein-rich start. You can include spinach, tomatoes, mushrooms, or bell peppers for extra vitamins.\n- Make overnight oats — just soak and refrigerate. Customize with fruits, nuts, honey, or peanut butter to suit your taste.\n- Greek yogurt with honey and berries for a refreshing twist. Add granola or seeds for crunch and fiber.\n- Avocado toast with poached eggs and a sprinkle of chili flakes offers healthy fats and keeps you full until lunch."
  },
  {
    "id": "blog3",
    "title": "Ultimate Chocolate Cake Recipe",
    "image": "chocolate_cake.jpg",
    "excerpt": "Moist, rich, and chocolatey — this cake is perfect for birthdays or any celebration...",
    "content": "Make a decadent chocolate cake with these steps:\n1. Use high-quality cocoa powder or melted dark chocolate for deep, rich flavor.\n2. Combine wet and dry ingredients carefully for a smooth, lump-free batter. Ensure eggs and butter are at room temperature for better mixing.\n3. Bake at the right temperature to avoid a dry cake. Check with a toothpick; it should come out slightly moist for maximum softness.\n4. Frost with chocolate ganache or buttercream. You can also add a layer of fruit jam between layers for extra flavor.\n5. Decorate with berries, nuts, or edible flowers for an elegant finish. Serve with a scoop of vanilla ice cream or whipped cream to elevate the dessert experience."
  },
  {
    "id": "blog4",
    "title": "5 Quick and Healthy Lunch Ideas",
    "image": "healthy_lunch.jpg",
    "excerpt": "Busy schedule? These meals are nutritious, tasty, and ready in under 20 minutes...",
    "content": "Healthy lunches don’t have to be boring:\n- Quinoa salad with roasted vegetables, chickpeas, and a light lemon-tahini dressing. Add feta or olives for more flavor.\n- Grilled chicken wraps with fresh greens, tomatoes, cucumber, and hummus. Serve with a side of baked sweet potato fries.\n- Lentil soup for a protein-packed meal. Enhance with garlic, herbs, and a squeeze of lemon juice.\n- Avocado toast with poached eggs and a sprinkle of sesame seeds. Top with cherry tomatoes or smoked salmon for a variation.\n- Veggie stir-fry with tofu, shrimp, or chicken. Use soy sauce, ginger, and garlic for a flavorful and quick option. Serve over brown rice or noodles for a complete meal."
  },
  {
    "id": "blog5",
    "title": "How to Make Homemade Pizza",
    "image": "homemade_pizza.jpg",
    "excerpt": "From soft crust to perfect toppings, learn to make pizza at home just like your favorite pizzeria...",
    "content": "Step-by-step pizza making:\n1. Prepare a soft and elastic dough. Let it rest for at least 1 hour for better rise and texture.\n2. Preheat your oven to a high temperature for a crispy crust. If available, use a pizza stone.\n3. Use a good tomato sauce, fresh mozzarella cheese, and a variety of toppings like mushrooms, olives, bell peppers, and pepperoni.\n4. Bake until golden and bubbling, rotating halfway for even cooking. Check the base to ensure it is cooked through.\n5. Slice and enjoy with your favorite dipping sauce. Experiment with different toppings, like BBQ chicken or pesto, and sprinkle fresh herbs like basil or oregano before serving."
  },
  {
    "id": "blog6",
    "title": "Refreshing Summer Smoothies",
    "image": "summer_smoothie.jpg",
    "excerpt": "Beat the heat with these fruity, refreshing, and healthy smoothie recipes...",
    "content": "Summer smoothies to try:\n- Mango and coconut smoothie for tropical vibes. Add a dash of lime juice to brighten the flavor.\n- Berry blend with Greek yogurt for antioxidants. Include blueberries, raspberries, and strawberries with a touch of honey.\n- Watermelon and mint for hydration. Add cucumber slices for an extra refreshing twist.\n- Pineapple and spinach for a green smoothie packed with vitamins. Include a small banana for natural sweetness.\n- Banana and peanut butter for an energy boost. Add oats or protein powder to make it more filling for breakfast or post-workout snack. Serve chilled with ice cubes for the ultimate summer refreshment."
  },
  {
    "id": "blog7",
    "title": "5 Easy Desserts for Beginners",
    "image": "easy_desserts.jpg",
    "excerpt": "No-bake, simple, and delicious desserts you can make without professional skills...",
    "content": "Quick dessert ideas:\n1. Chocolate mousse in glasses with whipped cream and chocolate shavings for a fancy look.\n2. Fruit parfait layered with yogurt, granola, and seasonal fruits. You can drizzle honey or chocolate syrup.\n3. No-bake cheesecake with a biscuit crust and creamy filling. Add fruit topping for extra appeal.\n4. Rice pudding flavored with cinnamon, cardamom, or vanilla. Serve warm or chilled.\n5. Easy brownie bites using pre-made mixes. Customize with nuts, chocolate chips, or caramel drizzle. Perfect for parties or snacks."
  },
  {
    "id": "blog8",
    "title": "The Art of Making Perfect Pasta",
    "image": "pasta.jpg",
    "excerpt": "Al dente pasta with delicious sauces — here’s how to master this Italian staple...",
    "content": "Perfect pasta tips:\n1. Use plenty of salted water for boiling. Stir occasionally to prevent sticking.\n2. Don’t overcook — aim for al dente. Taste a piece before draining.\n3. Reserve pasta water to adjust sauce consistency and help it cling to the pasta.\n4. Toss pasta in sauce immediately for even coating. Add cheese, herbs, or a drizzle of olive oil to finish.\n5. Garnish with fresh herbs, parmesan cheese, or chili flakes. Experiment with sauces like pesto, Alfredo, or a simple tomato basil for variety."
  },
  {
    "id": "blog9",
    "title": "5 Spice Blends Every Kitchen Needs",
    "image": "spices.jpg",
    "excerpt": "Enhance your cooking with these essential spice mixes that bring flavor to any dish...",
    "content": "Essential spice blends:\n1. Garam masala — perfect for Indian curries, lentils, and stews. Toast spices lightly for enhanced aroma.\n2. Italian seasoning — ideal for pasta, pizza, and roasted vegetables. Mix dried basil, oregano, thyme, and rosemary.\n3. Cajun spice — adds bold, smoky flavors to meats, fries, and seafood.\n4. Herbes de Provence — a fragrant mix for roasted vegetables, chicken, or fish. Combine thyme, rosemary, marjoram, and lavender.\n5. Taco seasoning — for Mexican dishes, tacos, and grilled meats. Blend chili powder, cumin, paprika, and garlic powder. Keep a small jar ready for quick seasoning."
  },
  {
    "id": "blog10",
    "title": "Homemade Bread Made Easy",
    "image": "homemade_bread.jpg",
    "excerpt": "Soft, fluffy, and golden — baking bread at home has never been easier...",
    "content": "Easy homemade bread tips:\n1. Use fresh yeast for better rise. Mix with warm water and a pinch of sugar to activate.\n2. Knead dough until smooth and elastic. This develops gluten for a soft, airy texture.\n3. Allow dough to rise properly, at least 1-2 hours, until doubled in size.\n4. Bake at correct temperature for golden crust. Use steam in the oven for a crisp exterior.\n5. Let it cool before slicing to avoid gummy texture. You can also add herbs, seeds, or cheese to the dough for extra flavor."
  }
]
